// # Завдання 3

// Створіть масив об'єктів "студентів", який містить властивості "ім'я", "вік" та
// "рейтинг". Додайте до масиву метод "вітатися", який буде повертати рядок з
// привітанням зі зазначенням імені студента.

// Використовуючи метод "map()", створіть новий масив, який містить привітання з
// кожним студентом з масиву "студентів". Використовуючи метод "filter()", створіть
// новий масив, який містить тільки ті об'єкти типу "студент", які мають рейтинг
// вище заданого значення.

// Створіть функцію "addRating", яка приймає один аргумент - кількість балів, на
// яку потрібно збільшити рейтинг студента. Викличте функцію "addRating" на кожному
// елементі масиву "студентів". Перевірте, що в контексті функції "addRating"
// значення "this" вказує на конкретний об'єкт "студент". Виведіть новий масив зі
// зміненими рейтингами в консоль.

const studends = [
    { name: "Vasia", age: 18, counter: 4.8 },
    { name: "Kolia", age: 17, counter: 4.1 },
    { name: "Pavlo", age: 18, counter: 3.9 },
    { name: "Vika", age: 19, counter: 4.4 },
    { name: "Katia", age: 18, counter: 4.6 },
]        
    
    hello(){
        return `Hello ${studends.name}`},

console.log(hello(studends))